[[cypher-writes-on-gds]]
= Updating with Cypher
:description: This chapter explains how to execute Cypher queries on named graphs in the Neo4j Graph Data Science library.


include::partial$/operations-reference/alpha-note.adoc[]

include::partial$/common-usage/not-on-aurads-note.adoc[]

NOTE: This feature requires Neo4j Enterprise Edition.

Using an xref:management-ops/graph-reads/create-cypher-db.adoc#_syntax[ephemeral database], you can use Cypher to update your graph as well as xref:management-ops/graph-reads/create-cypher-db.adoc#_read_query[reading from it].

[[create-ephemeral-db-example]]
== Example

This example shows the creation of an ephemeral database from a simple social network graph and its usage with Cypher queries.

=== Setup

include::partial$/management-ops/ephemeral-db/create-example.adoc[]

=== Update query

As an example of updating the graph, we add a `level` node property only to some nodes that match a given condition:

[source, cypher, role=noplay]
----
MATCH (n:Person)
WHERE n.age > 40
SET n.level = 3
RETURN n.age, n.level
----

.Results
[opts="header"]
|===
| n.age | n.level
| 42    | 3
|===

Then, we run a Cypher query to check that the new property has actually been added:

[source, cypher, role=noplay]
----
MATCH (n:Person)
WHERE n.level = 3
RETURN n.age, n.level
----

.Results
[opts="header"]
|===
| n.age | n.level
| 42    | 3
|===

[[drop-ephemeral-db]]
=== Cleanup

include::partial$/management-ops/ephemeral-db/drop-example.adoc[]

include::partial$/management-ops/ephemeral-db/limitations.adoc[]