[[create-cypher-db]]
[.alpha]
= Cypher on GDS graph

[abstract]
--
This chapter explains how to execute Cypher queries on named graphs in the Neo4j Graph Data Science library.
--

Exploring in-memory graphs after loading them and potentially executing algorithms in mutate mode can be tricky in the Neo4j Graph Data Science library.
A natural way to achieve this in the Neo4j database is to use Cypher queries.
Cypher queries allow for example to get a hold of which properties are present on a node among many other things.
Executing Cypher queries on an in-memory graph can be achieved by leveraging the `gds.alpha.create.cypherdb` procedure.
This procedure will create a new impermanent database which you can switch to.
That database will then use data from the in-memory graph as compared to the store files for usual Neo4j databases.

[[create-cypher-db-limitations]]
== Limitations

Although it is possible to execute arbitrary Cypher queries on the database created by the `gds.alpha.create.cypherdb` procedure, not every aspect of Cypher is implemented yet.
Some known limitations are listed below:

* Dropping the newly created database
** Restarting the DBMS will remove the database instead
* Writes
** All queries that attempt to write things, such as nodes, properties or labels, will fail
* Referencing relationships
** Referencing variables bound to a relationship is not supported, this includes returning relationships
** It is however possible to use relationship as traversal, i.e. `MATCH (n)-[:KNOWS]->(m)` will work as expected

[[create-cypher-db-syntax]]
== Syntax

[.create-cypher-db-syntax]
--
[source, cypher, role=noplay]
----
CALL gds.alpha.create.cypherdb(
    dbName: String
    graphName: String
)
YIELD
    dbName: String,
    graphName: String,
    createMillis: Integer
----

.Parameters
[opts="header",cols="1,1,1, 4"]
|===
| Name                  | Type                | Optional | Description
| dbName                | String              | no       | The name under which the new database is stored.
| graphName             | String              | no       | The name under which the graph is stored in the catalog.
|===

.Results
[opts="header",cols="2,1,4"]
|===
| Name                   | Type     | Description
| dbName                 | String   | The name under which the new database is stored.
| graphName              | String   | The name under which the graph is stored in the catalog.
| createMillis           | Integer  | Milliseconds for creating the database.
|===
--

[[create-cypher-db-example]]
== Example

To demonstrate how to execute cypher statements on in-memory graphs we are going to create a simple social network graph.
We will use that graph to create a new database with on which we will execute our statements.

[source, cypher, role=noplay setup-query]
----
CREATE
  (alice:Person { name: 'Alice', age: 23 }),
  (bob:Person { name: 'Bob', age: 42 }),
  (carl:Person { name: 'Carl', age: 31),

  (alice)-[:KNOWS]->(bob),
  (bob)-[:KNOWS]->(alice),
  (alice)-[:KNOWS]->(carl)
----

We will now load a graph projection of the created graph via the <<catalog-graph-create, graph create>> procedure:

[role=query-example]
--
.Project `Person` nodes and `KNOWS` relationships:
[source, cypher, role=noplay]
----
CALL gds.graph.create(
  'social_network',
  'Person',
  'KNOWS'
)
YIELD
  graphName, nodeCount, relationshipCount
----

.Results
[opts="header", cols="1,3m,1,3m,1m"]
|===
| graph            | nodeCont | relationshipCount
| "social_persons" | 3        | 3
|===
--

With a named graph loaded into the Neo4j Graph Data Science library, we can proceed to create the new database using the loaded graph as underlying data.

[role=query-example]
--
.Create a new database `gdsDb` using our `social_network` graph:
[source, cypher, role=noplay]
----
CALL gds.alpha.create.cypherdb(
  'gdsDb',
  'social_network'
)
----
--

In order to verify that the new database was created successfully we can use the Neo4j database administration commands.

[role=query-example]
--
[source, cypher, role=noplay]
----
SHOW DATABASES
----
--

We can now switch to the newly created database.

[role=query-example]
--
[source, cypher, role=noplay]
----
:use gdsDb
----
--

Finally, we are set up to execute cypher queries on our in-memory graph.

[role=query-example]
--
[source, cypher, role=noplay]
----
MATCH (n:Person)-[:KNOWS]->(m:Person) RETURN n.age AS age1, m.age AS age2
----

.Results
[opts="header", cols="1,3m,1,3m,1m"]
|===
| age1 | age2
| 23   | 42
| 42   | 23
| 23   | 31
|===
--

We can see that the returned ages correspond to the structure of the original graph.
