[[algorithms-particle-filtering-centrality]]
[.alpha]
= Particle Filtering

[abstract]
--
This section describes the Particle Filtering algorithm in the Neo4j Graph Data Science library.
--

Particle filtering methods produce an approximation of the Personalized Page Rank (PPR) score with sufficient precision while exploiting what graph databases architectures are already optimized for: navigating local connections.

Personalized Page Rank (PPR) is a particularly important task to support search and exploration within graphs.
PPR computes the proximity between query nodes and other local nodes in the graph.
In practice, given a small set of query entities, PPR returns a ranked list of other relevant entities based on a computed random-walk proximity to the query nodes.
This is used, among others, for entity exploration, query expansion, and product recommendation.

It is an alternative to the <<algorithms-page-rank-examples-personalised, Personalized Page Rank>> algorithm that runs directly against Neo4j rather than a projected graph.

include::alpha-note.adoc[]

* <<algorithms-particle-filtering-context, History and explanation>>
* <<algorithms-particle-filtering-usecase, Use-cases - when to use the Particle Filtering algorithm>>
* <<algorithms-particle-filtering-syntax, Syntax>>
* <<algorithms-particle-filtering-examples, Examples>>

[[algorithms-particle-filtering-context]]
== History and explanation

Particle Filtering was proposed by Lao, Ni, and William W. Cohen. in https://doi.org/10.1145/1835804.1835916["Fast query execution for retrieval models based on path-constrained random walks."^] at Proceedings of the 16th ACM SIGKDD international conference on Knowledge discovery and data mining. 2010.

The implementation used in the library was proposed by Denis Gallo, Matteo Lissandrini, and Yannis Velegrakis in their 2020 paper https://people.cs.aau.dk/~matteo/pdf/EDBT20-particle-filtering.pdf[Personalized Page Rank on Knowledge Graphs: Particle Filtering is all you need!^].

[[algorithms-particle-filtering-usecase]]
== Use-cases - when to use the Particle Filtering algorithm

* Particle filtering has been used to build the movie recommendation engine used by https://mindreader.tech/[MindReader^], a novel dataset providing explicit user ratings over a knowledge graph within the movie domain.
Read more in https://towardsdatascience.com/movie-recommendations-powered-by-knowledge-graphs-and-neo4j-33603a212ad0[Movie Recommendations powered by Knowledge Graphs and Neo4j^].

[[algorithms-particle-filtering-syntax]]
== Syntax

.The following will run the algorithm and stream back results:
[source, cypher]
----
CALL gds.alpha.particleFiltering.stream(configuration: Map)
YIELD nodeId, score
----

.Configuration
[opts="header",cols="1,1,1,1,4"]
|===
| Name                          | Type    | Default                | Optional | Description
| sourceNodes                | List    | []        | yes      | A set of nodes to use for computing Particle Filtering.
| numberParticles                   | int     | 10                      | yes      | The number of particles
| minimumThreshold               | float     | 0.5 | yes      | The minimum threshold for scores. Values below this will not be returned.
| dampingFactor                 | float   | 0.85                   | yes      | The damping factor of the Particle Filtering calculation.
| relationshipType                 | String   | null                   | yes      | The relationship type to use.
| direction                 | String   | OUTGOING                   | yes      | The direction of the relationship type.
| shuffleNeighbors                 | Boolean   | true                   | yes      | Whether to shuffle neighboring nodes before iterating over them.
|===

[[algorithms-particle-filtering-examples]]
== Examples

In this section we will show examples of executing the Particle Filtering algorithm on a concrete graph.
The intention is to illustrate what the results look like and to provide a guide in how to make use of the algorithm in a real setting.
The example graph looks like this:

image::page-rank-graph.svg[align="center"]

.The following Cypher statement will create the example graph in the Neo4j database:
[source, cypher, role=setup-query]
----
include::../page-rank/sample-graph.cypher[tag=setup]
----

The following examples show how to run Particle Filtering centered around 'Site A'.

[role=query-example]
--
.The following will run the algorithm and stream results:
[source, cypher]
----
MATCH (siteA:Page {name: 'Site A'})
CALL gds.alpha.particleFiltering.stream({
  dampingFactor: 0.85,
  minimumThreshold: 0.1,
  sourceNodes: [siteA]
})
YIELD nodeId, score
RETURN gds.util.asNode(nodeId).name AS name, score
ORDER BY score DESC, name ASC;
----

.Results
[opts="header",cols="1,1"]
|===
| name      | score
| "Home"    | 14.038908401932435
| "Site A"  | 10.209621333333333
| "Links"   | 3.187824337893309
| "About"   | 3.1365738231023323
| "Product" | 2.147320778872834
| "Site C"  | 0.5275333333333333
| "Site D"  | 0.5094166666666666
|===
--