[[cypher-on-gds]]
= Running Cypher queries
:description: This chapter explains how to execute Cypher queries on named graphs in the Neo4j Graph Data Science library.
:page-aliases: management-ops/create-cypher-db


include::partial$/operations-reference/alpha-note.adoc[]

include::partial$/common-usage/not-on-aurads-note.adoc[]

NOTE: This feature requires Neo4j Enterprise Edition.

Besides `stream` procedures, you can also use Cypher queries to inspect nodes and relationships in a graph.

The `gds.ephemeral.database.create` procedure creates an ephemeral Neo4j database that mirrors your in-memory graph.
Once the database is created, you can run Cypher queries on it as you would on any Neo4j database.
You can also xref:management-ops/graph-update/write-with-cypher.adoc[update the graph] using Cypher.

== Syntax

[[create-ephemeral-db-example]]
=== Creating an ephemeral database

include::partial$/management-ops/ephemeral-db/create-syntax.adoc[]

[[drop-ephemeral-db-procedure-syntax]]
=== Dropping an ephemeral database

include::partial$/management-ops/ephemeral-db/drop-syntax.adoc[]

== Example

This example shows the creation of an ephemeral database from a simple social network graph and its usage with Cypher queries.

[[create-ephemeral-db-syntax]]
=== Setup

include::partial$/management-ops/ephemeral-db/create-example.adoc[]

=== Read query

We are set up to execute Cypher queries on the in-memory database.

[source, cypher, role=noplay]
----
MATCH (n:Person)-[:KNOWS]->(m:Person) RETURN n.age AS age1, m.age AS age2
----

.Results
[opts="header"]
|===
| age1 | age2
| 23   | 42
| 42   | 23
| 23   | 31
|===

We can see that the returned properties correspond to those from the original graph.

It is important to note that the `name` property cannot be retrieved from the ephemeral database because it is not present in the projected graph.

[[drop-ephemeral-db]]
=== Cleanup

include::partial$/management-ops/ephemeral-db/drop-example.adoc[]

[[ephemeral-db-limitations]]
== Limitations

Although it is possible to execute arbitrary Cypher queries on the ephemeral database, the database itself is _not_ a plain Neo4j database.
As such, not every aspect of Cypher is implemented.