[[cypher-on-gds]]
= Running Cypher queries (Deprecated)
:description: This chapter explains how to execute Cypher queries on named graphs in the Neo4j Graph Data Science library.
:page-aliases: management-ops/create-cypher-db, management-ops/graph-reads/create-cypher-db

[WARNING]
--
This page describes running cypher queries on an in-memory graph which is deprecated and will be removed.
There will be no replacement due to low adoption of this feature.
--

include::partial$/operations-reference/alpha-note.adoc[]

include::partial$/common-usage/not-on-aurads-note.adoc[]

NOTE: This feature requires Neo4j Enterprise Edition.

Besides `stream` procedures, you can also use Cypher queries to inspect nodes and relationships in a graph.

The `gds.ephemeral.database.create` procedure creates an ephemeral Neo4j database that mirrors your in-memory graph.
Once the database is created, you can run Cypher queries on it as you would on any Neo4j database.

== Syntax

[[create-ephemeral-db-syntax]]
=== Creating an ephemeral database

include::partial$/management-ops/ephemeral-db/create-syntax.adoc[]

[[drop-ephemeral-db-syntax]]
=== Dropping an ephemeral database

include::partial$/management-ops/ephemeral-db/drop-syntax.adoc[]

[[create-ephemeral-db-example]]
== Example

This example shows the creation of an ephemeral database from a simple social network graph and its usage with Cypher queries.

=== Setup

include::partial$/management-ops/ephemeral-db/create-example.adoc[]

=== Read query

We can now run a `MATCH` Cypher query on the in-memory database and check the results:
[role=query-example]
--
[source, cypher, role=noplay, database=gdsdb]
----
MATCH (n:Person)-[:KNOWS]->(m:Person) RETURN n.age AS age1, m.age AS age2
ORDER BY age1, age2
----

.Results
[opts="header"]
|===
| age1 | age2
| 23   | 31
| 23   | 42
| 42   | 23
|===
--

The returned properties correctly match those from the original graph.

It is important to note that the `name` property cannot be retrieved from the ephemeral database because it is not present in the projected graph.
If you need to retrieve properties from the Neo4j database at the same time, you can use a link:https://neo4j.com/docs/graph-data-science/current/production-deployment/composite/[composite database].

[[drop-ephemeral-db]]
=== Cleanup

include::partial$/management-ops/ephemeral-db/drop-example.adoc[]

include::partial$/management-ops/ephemeral-db/limitations.adoc[]